# ContinuousRailType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContinuousRailType Class
Members See Also
---
A type element containing the properties of a continuous rail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class ContinuousRailType : ElementType
```

Visual Basic
---
```text
Public Class ContinuousRailType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class ContinuousRailType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Architecture..::..ContinuousRailType Autodesk.Revit.DB.Architecture..::..HandRailType Autodesk.Revit.DB.Architecture..::..TopRailType
# See Also
ContinuousRailType Members
Autodesk.Revit.DB.Architecture Namespace